DataProcessors/Renault_КалендарьСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_КалендарьСобытий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКалендаря</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалСлота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВыходные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПодбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыСобытий</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСобытий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ОбластиПрименения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ОбластиПрименения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ВидыСобытий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбластиПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ОбластиПрименения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_КалендарьСобытий/Forms/ГрафикОплатНовый/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Календарь.Сотрудник=ПараметрыСеанса.Пользователь.Сотрудник;
	Календарь.ВидКалендаря=2;
	
	Интервал=5;
	Календарь.ИнтервалСлота=30;
	ЗаголовокИнтервала();
	Календарь.ТочностьПланирования=Календарь.ИнтервалСлота;
	
	Календарь.ОтображатьВыходные=Истина;
	Календарь.ДатаКалендаря=ТекущаяДата();
	УстановитьПериод();
	Календарь.ПервыйЧас=Календарь.НачалоРабочегоВремени;
	Календарь.РежимПодбора=Ложь;
	Календарь.ТолькоЧтение=Ложь;
	
	Массив=Новый Массив; Массив.Добавить(Справочники.CRM_ВидыСобытий.Оплата);
	Календарь.ВидыСобытий.ЗагрузитьЗначения(Массив);
	
	ЦветАктивно = Вычислить(Renault_ОбщиеФункцииСервер.МультибрендПараметрыОформления().ОсновнойЦвет);	
	
	Если Параметры.Свойство("IDK") Тогда
		IDK = Параметры.IDK;
	КонецЕсли;
	
	Если Календарь.КоличествоСобытий = 0 Тогда
		Календарь.КоличествоСобытий = 30;	
	КонецЕсли;
	
	ДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Массив = Новый Массив;
	Массив.Добавить(Элементы.Декорация3);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив, "Картинка", "Логотип");

	Массив=Новый Массив;
	Массив.Добавить(Элементы.кнПредыдущийПериод);
	Массив.Добавить(Элементы.кнСледующийПериод);
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветФона","ОсновнойЦвет");	
	Renault_ОбщиеФункции.МультибрендЗадатьОформление(Массив,"ЦветРамки","ОсновнойЦвет");	

	ОбновитьКалендарь();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКалендарь(Команда=Ложь) Экспорт 
	ОбновитьHTML();
	ОбновитьПланировщик();
КонецПроцедуры

Процедура ОбновитьHTML() СтрокаHTML=РеквизитФормыВЗначение("Календарь").ПолучитьHTML() КонецПроцедуры

&НаКлиенте
Процедура ВидКалендаря(Команда)
	Если Команда.Имя="День" Тогда Календарь.ВидКалендаря=1 //день
	ИначеЕсли Команда.Имя="Неделя" Тогда Календарь.ВидКалендаря=2 //неделя
	ИначеЕсли Команда.Имя="Месяц" Тогда Календарь.ВидКалендаря=3 //месяц
	//Иначе Календарь.ВидКалендаря=4 // повестка дня
	КонецЕсли;
	ДоступностьЭлементов();
	УстановитьПериод();
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура кнТолькоСвои(Команда)
	Календарь.Сотрудник=?(Календарь.Сотрудник.Пустая(),ПараметрыСеанса.Пользователь.Сотрудник,Календарь.Сотрудник.Пустая()); 
	ДоступностьЭлементов();
	ОбновитьКалендарь();
КонецПроцедуры

Функция ДоступностьЭлементов()
	ЦветНеАктивно=Новый Цвет(231,231,231);
	//ЦветАктивно=Новый Цвет(255,207,0);
	ЦветРамки=Новый Цвет(156,166,178);
	
	Элементы.кнТолькоСвои.ЦветФона=?(Календарь.Сотрудник.Пустая(),ЦветНеАктивно,ЦветАктивно);
	Элементы.кнТолькоСвои.ЦветРамки=?(Календарь.Сотрудник.Пустая(),ЦветРамки,ЦветАктивно);
	
	Элементы.кнДень.ЦветФона=ЦветНеАктивно;
	Элементы.кнНеделя.ЦветФона=ЦветНеАктивно;
	Элементы.кнМесяц.ЦветФона=ЦветНеАктивно;
	Элементы.кнДень.ЦветРамки=ЦветРамки;
	Элементы.кнНеделя.ЦветРамки=ЦветРамки;
	Элементы.кнМесяц.ЦветРамки=ЦветРамки;
	
	Элементы.День.Доступность=Истина;
	Элементы.Неделя.Доступность=Истина;
	Элементы.Месяц.Доступность=Истина;
	//Элементы.ПовесткаДня.Доступность=Истина;
	
	Если Календарь.ВидКалендаря=1 Тогда
		Элементы.День.Доступность=Ложь;
		Элементы.кнДень.ЦветФона=ЦветАктивно;
		Элементы.кнДень.ЦветРамки=ЦветАктивно;
	ИначеЕсли Календарь.ВидКалендаря=2 Тогда
		Элементы.Неделя.Доступность=Ложь;
		Элементы.кнНеделя.ЦветФона=ЦветАктивно;
		Элементы.кнНеделя.ЦветРамки=ЦветАктивно;
	ИначеЕсли Календарь.ВидКалендаря=3 Тогда
		Элементы.Месяц.Доступность=Ложь;
		Элементы.кнМесяц.ЦветФона=ЦветАктивно;
		Элементы.кнМесяц.ЦветРамки=ЦветАктивно;
		//Элементы.ПовесткаДня.Доступность=Истина;
	//ИначеЕсли Календарь.ВидКалендаря=4 Тогда
	//	Элементы.ПовесткаДня.Доступность=Ложь;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура СдвинутьПериод(Команда)
	Если Команда.Имя="ПредыдущийПериод" Тогда
		Если Календарь.ВидКалендаря=2 Тогда 
			Сек=Календарь.ДатаКалендаря-НачалоНедели(Календарь.ДатаКалендаря);
			Календарь.ДатаКалендаря=НачалоНедели(НачалоНедели(Календарь.ДатаКалендаря)-1)+Сек;
		ИначеЕсли Календарь.ВидКалендаря=3 Тогда
			Календарь.ДатаКалендаря=ДобавитьМесяц(Календарь.ДатаКалендаря,-1);
		Иначе
			Календарь.ДатаКалендаря=Календарь.ДатаКалендаря-24*3600;
		КонецЕсли;	
	ИначеЕсли Команда.Имя="СледующийПериод" Тогда
		Если Календарь.ВидКалендаря=2 Тогда 
			Сек=Календарь.ДатаКалендаря-НачалоНедели(Календарь.ДатаКалендаря);
			Календарь.ДатаКалендаря=КонецНедели(Календарь.ДатаКалендаря)+1+Сек;
		ИначеЕсли Календарь.ВидКалендаря=3 Тогда
			Календарь.ДатаКалендаря=ДобавитьМесяц(Календарь.ДатаКалендаря,1);
		Иначе
			Календарь.ДатаКалендаря=Календарь.ДатаКалендаря+24*3600;
		КонецЕсли;	
	КонецЕсли;	
	УстановитьПериод();
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура кнОтбор(Команда)
	Парам=Новый Структура;
	Парам.Вставить("Сотрудник",Календарь.Сотрудник);
	ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ФормаОтбора",Парам,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура кнВыбратьПериод(Команда) ОткрытьФорму("Обработка.Renault_КалендарьСобытий.Форма.ВыборДаты",Новый Структура("Дата",Календарь.ДатаКалендаря),ЭтаФорма) КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	Обработки.Renault_КалендарьСобытий.УстановитьПериод(Календарь);
	Обработки.Renault_КалендарьСобытий.УстановитьИнтервалРабочегоВремени(Календарь);
	Элементы.кнПериод.Заголовок=Обработки.Renault_КалендарьСобытий.ПериодСтрокой(Календарь);
КонецПроцедуры	

&НаКлиенте
Процедура СтрокаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) Обработки.Renault_КалендарьСобытий.ОбработкаСобытия(Элемент.Документ,ЭтаФорма, IDK) КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Если ИмяСобытия="ОбновитьСобытия" Тогда ОбновитьКалендарь() КонецЕсли КонецПроцедуры

&НаКлиенте
Процедура кнПриличныйИнтерфейс(Команда)
	Элементы.ГруппаШапкаФормы.Видимость=Истина;
	Элементы.ПаненьКнопок.Видимость=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСлотаПриИзменении(Элемент) 
	Соответствие=Новый Соответствие;
	Соответствие.Вставить(1,5);
	Соответствие.Вставить(2,10);
	Соответствие.Вставить(3,15);
	Соответствие.Вставить(4,20);
	Соответствие.Вставить(5,30);
	Соответствие.Вставить(6,60);
	Календарь.ИнтервалСлота=Соответствие.Получить(Интервал);
	ЗаголовокИнтервала();
	ОбновитьHTML();
	ОбновитьПланировщик();
КонецПроцедуры
Процедура ЗаголовокИнтервала() Элементы.Интервал.Заголовок="Интервал "+Календарь.ИнтервалСлота+" мин." КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщик()
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	ДатаНачала = Календарь.НачалоПериода;
	
	Пока ДатаНачала < Календарь.ОкончаниеПериода Цикл
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачала + Календарь.ПервыйЧас*60*60, ДатаНачала + Календарь.ОкончаниеРабочегоВремени*60*60);
		ДатаНачала = ДатаНачала + 86400;
	КонецЦикла;
	
	ТекстЗадачи="
		|Выбрать
		|	События.Номер Номер,
		|   События.Комментарий,
		|	События.КомментарийЗакрытия,
		|	ЕстьNULL(Подстрока(РЛ.Клиент.НаименованиеПолное,0,100),"""") Клиент,
		|	ЕстьNULL(ВЫРАЗИТЬ (Контакты.Представление КАК СТРОКА(40)),"""") Телефон,
		|	События.ДатаНапоминания Начало,
		|	Выбор Когда События.Длительность=0 Тогда ДобавитьКДате(События.ДатаНапоминания,Минута,&ИнтервалСлота) Иначе ДобавитьКДате(События.ДатаНапоминания,Минута,Длительность) Конец Окончание,
		|	Выбор Когда События.ДатаЗакрытия=ДатаВремя(1,1,1) Тогда Ложь Иначе Истина Конец Завершено,
		|	События.ВидСобытия,
		|   События.ЦветФона,
		|   События.ЦветТекста
		|ИЗ Документ.CRM_СобытияПоРабочимЛистам События
		|Левое Соединение РегистрСведений.Renault_РабочиеЛисты РЛ 
		|	Левое Соединение РегистрСведений.КонтактнаяИнформация Контакты ПО РЛ.Клиент=Контакты.Объект И Контакты.Тип=ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон) И Контакты.ЗначениеПоУмолчанию=Истина
		|По События.IDK=РЛ.IDK 
		|ГДЕ События.Проведен И События.ДатаНапоминания Между &Дата1 И &Дата2 И События.ВидСобытия В(&ВидыСобытий)"
		+?(Календарь.Сотрудник.Пустая(),"",
		" И События.Сотрудник=&Сотрудник ");
	
	Запрос=Новый Запрос(ТекстЗадачи);
	Запрос.УстановитьПараметр("Дата1", Календарь.НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", Календарь.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ИнтервалСлота", Календарь.ИнтервалСлота);
	Запрос.УстановитьПараметр("ВидыСобытий", РазрешенныеВидыСобытий(Календарь.ВидыСобытий.ВыгрузитьЗначения()));
	Запрос.УстановитьПараметр("Сотрудник", Календарь.Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВыведеноСобытий = 0;
	
	Планировщик.Элементы.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		лЭлемент = Планировщик.Элементы.Добавить(Выборка.Начало, Выборка.Окончание);
		лЭлемент.Текст = ПредставлениеСобытия(Выборка);
		лЭлемент.Значение = Выборка.Номер;
		лЭлемент.ЦветФона = Цвет(Выборка, "ЦветФона");
		лЭлемент.ЦветТекста = Цвет(Выборка, "ЦветТекста");
		
		ВыведеноСобытий = ВыведеноСобытий + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция Цвет(Выборка,ТипЦвета)
	
	Если Выборка.Завершено Тогда 
		Возврат ?(ТипЦвета = "ЦветФона", Новый Цвет(124,124,124), Новый Цвет(0,0,0)); 
	КонецЕсли;
	
	ОписаниеЦвета = ?(СокрЛП(Выборка[ТипЦвета]) = "", Выборка.ВидСобытия[ТипЦвета], Выборка[ТипЦвета]);
	МассивЦвета = РазложитьСтрокуВМассив(ОписаниеЦвета);
	Возврат Новый Цвет(МассивЦвета[0], МассивЦвета[1], МассивЦвета[2]);
	
КонецФункции

&НаСервере
Функция РазложитьСтрокуВМассив(ОписаниеЦвета)
	
	ОписаниеЦвета = СокрЛП(ОписаниеЦвета);
	МассивЦвета = Новый Массив;
	Если НЕ ЗначениеЗаполнено(ОписаниеЦвета) Тогда
		МассивЦвета.Добавить(0);
		МассивЦвета.Добавить(0);
		МассивЦвета.Добавить(0);
		Возврат МассивЦвета;
	КонецЕсли;
	
	Позиция = Найти(ОписаниеЦвета, ",");
	Цифра = Лев(ОписаниеЦвета, Позиция - 1);
	МассивЦвета.Добавить(Число(Цифра));
	
	ОписаниеЦвета = Сред(ОписаниеЦвета, Позиция + 1, СтрДлина(ОписаниеЦвета) - Позиция);
	
	Позиция = Найти(ОписаниеЦвета, ",");
	Цифра = Лев(ОписаниеЦвета, Позиция - 1);
	МассивЦвета.Добавить(Число(Цифра));
	
	ОписаниеЦвета = Сред(ОписаниеЦвета, Позиция + 1, СтрДлина(ОписаниеЦвета) - Позиция);
	
	МассивЦвета.Добавить(Число(ОписаниеЦвета));
	
	Возврат МассивЦвета;
	
КонецФункции

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТипСобытия = "";
	
	НачалоСобытия = Начало;
	ОкончаниеСобытия = Конец;
	
	//вид события определяем по первому элемента списка видов события календаря
	ВидСобытия = Справочники.CRM_ВидыСобытий.Прочее;
	Для Каждого Эл Из ЭтаФорма.Календарь.ВидыСобытий Цикл
		Если ТипЗнч(Эл.Значение) = Тип("СправочникСсылка.CRM_ВидыСобытий") Тогда
			ВидСобытия = Эл.Значение;
			Прервать
		КонецЕсли;	
	КонецЦикла;
	
	Если ТипСобытия = "ОФУ" Тогда
		
		ЗначенияЗаполнения=Новый Структура("Дата,ДатаЗакрытия,ВидСобытия,ОбластьПрименения", НачалоСобытия, ОкончаниеСобытия, ВидСобытия, Перечисления.Renault_ОбластиПрименения.ОФУ);
		ОткрытьФорму("Задача.Renault_События.ФормаОбъекта", ЗначенияЗаполнения, ЭтаФорма);
		
	Иначе
		
		Док = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
		Док.ВидСобытия = ВидСобытия;
		Док.IDK        = IDK;
		Док.ДатаНапоминания = НачалоСобытия;
		Док.Длительность = Окр((ОкончаниеСобытия-НачалоСобытия)/60, 0);
		Док.ПолучитьФорму("ФормаСозданияСобытия",ЭтаФорма,1).Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Планировщик.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Док = Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(Элементы.Планировщик.ВыделенныеЭлементы[0].Значение);
	Док.ПолучитьФорму("ФормаЗавершенияСобытия", ЭтаФорма).Открыть();
		
КонецПроцедуры

&НаСервере
Функция РазрешенныеВидыСобытий(МассивВсехСобытий) Экспорт 
	
	//МассивВсехСобытий - может содержать Справочники.CRM_ВидыСобытий,Перечисление.Renault_ОбластиПрименения
	События=ВыбратьСобытияИзОбластейПрименений(МассивВсехСобытий);
	
	МассивРазрешенных=Справочники.CRM_ВидыСобытий.РазрешенныеСобытия("Просмотр");
	Если События.Количество()=0 Тогда Возврат МассивРазрешенных КонецЕсли;
	
	МассивСобытий=Новый Массив;
	Для Каждого Событие Из События Цикл
		Если МассивРазрешенных.Найти(Событие)<>Неопределено Тогда
			МассивСобытий.Добавить(Событие)
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивСобытий
КонецФункции	

&НаСервере
Функция ВыбратьСобытияИзОбластейПрименений(Массив)
	События=Новый Массив;
	Для Каждого Эл Из Массив Цикл
		Если ТипЗнч(Эл)=Тип("СправочникСсылка.CRM_ВидыСобытий") Тогда
			События.Добавить(Эл)
		ИначеЕсли ТипЗнч(Эл)=Тип("ПеречислениеСсылка.Renault_ОбластиПрименения") Тогда
			Для Каждого ВидСобытия Из Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластиПрименения(Эл,"Просмотр") Цикл
				События.Добавить(ВидСобытия)
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
	Возврат События
КонецФункции

&НаСервере
Функция ПредставлениеСобытия(Выборка)
	
	Стр = СокрЛП(Выборка.Комментарий);
	
	Если НЕ ПустаяСтрока(Выборка.КомментарийЗакрытия) Тогда 
		Стр = Стр + Символы.ПС + СокрЛП(Выборка.КомментарийЗакрытия); 
	КонецЕсли;
	
	Если Выборка.Клиент <> "" Тогда 
		Стр = Стр + Символы.ПС + Выборка.Клиент; 
	КонецЕсли;
	
	Если Выборка.Телефон <> "" Тогда
		Стр = Стр + " (" + Выборка.Телефон + ")" ;
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ПланировщикПриИзменении(Элемент)
	
	ВсегоСобытий = Планировщик.Элементы.Количество();
	Номер = 1;
	
	Для Каждого Строка Из Планировщик.Элементы Цикл
		
		Состояние("Проверка событий", Номер / ВсегоСобытий);
		
		ПроверитьИзменитьСобытие(Строка.Значение, Строка.Начало, Строка.Конец);
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзменитьСобытие(НомерДокумента, ВремяНачало, ВремяКонец)
	
	Док = Документы.CRM_СобытияПоРабочимЛистам.НайтиПоНомеру(НомерДокумента);
	
	Если Док.ДатаНапоминания <> ВремяНачало Тогда
		
		лДок = Док.ПолучитьОбъект();
		лДок.ДатаНапоминания = ВремяНачало;
		
		Попытка
			лДок.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
